# Intermediate SQL

## Filtering Records

#### Using OR

This time you'll write a query to get the `title` and `release_year` of films released in 1990 or 1999, which were in English or Spanish and took in more than $2,000,000 `gross`.

It looks like a lot, but you can build the query up one step at a time to get comfortable with the underlying concept in each step. Let's go!

In [1]:
import cx_Oracle
import pandas as pd

def print_all():
    connection = cx_Oracle.connect(user="DATASETS_CHAN", password="123", dsn="localhost:1521/xe")
    cursor = connection.cursor()
    cursor.execute("SELECT * FROM FILMS")
    return pd.DataFrame(cursor)

def run_statement(sql):
    connection = cx_Oracle.connect(user="DATASETS_CHAN", password="123", dsn="localhost:1521/xe")
    cursor = connection.cursor()
    cursor.execute(sql)
    display(pd.DataFrame(cursor))

#### Instructions
* Select the `title` and `release_year` for films released in 1990 or 1999 using only `WHERE` and `OR`.

In [3]:
# -- Find the title and year of films from the 1990 or 1999
sql = """
SELECT title, release_year
FROM films
WHERE release_year = 1990
    OR release_year = 1999
"""
run_statement(sql)

                                 0     1
0                    Arachnophobia  1990
1      Back to the Future Part III  1990
2                   Child's Play 2  1990
3               Dances with Wolves  1990
4                  Days of Thunder  1990
..                             ...   ...
193               Twin Falls Idaho  1999
194  Universal Soldier: The Return  1999
195                  Varsity Blues  1999
196                 Wild Wild West  1999
197                 Wing Commander  1999

[198 rows x 2 columns]

* Filter the records to only include English or Spanish-language films.

In [5]:
# -- Update the query to see all German-language films released after 2000
sql = """
SELECT title, release_year
FROM films
WHERE (release_year = 1990 OR release_year = 1999)
-- Add a filter to see only English or Spanish-language films
    AND (language = 'English' OR language = 'Spanish')
"""
run_statement(sql)

                                 0     1
0                    Arachnophobia  1990
1      Back to the Future Part III  1990
2                   Child's Play 2  1990
3               Dances with Wolves  1990
4                  Days of Thunder  1990
..                             ...   ...
191               Twin Falls Idaho  1999
192  Universal Soldier: The Return  1999
193                  Varsity Blues  1999
194                 Wild Wild West  1999
195                 Wing Commander  1999

[196 rows x 2 columns]

* Finally, restrict the query to only return films worth more than $2,000,000 `gross`.

In [7]:
# -- Select all records for German-language films released after 2000 and before 2010
sql = """
SELECT title, release_year
FROM films
WHERE (release_year = 1990 OR release_year = 1999)
	AND (language = 'English' OR language = 'Spanish')
-- Filter films with more than $2,000,000 gross
	AND gross > 2000000
"""
run_statement(sql)

                                 0     1
0                    Arachnophobia  1990
1      Back to the Future Part III  1990
2                   Child's Play 2  1990
3               Dances with Wolves  1990
4                  Days of Thunder  1990
..                             ...   ...
163                       Trippin'  1999
164  Universal Soldier: The Return  1999
165                  Varsity Blues  1999
166                 Wild Wild West  1999
167                 Wing Commander  1999

[168 rows x 2 columns]